ZeroZap/xhsc/HC32L19x/driver/src/hc32l19x_adt.c
/******************************************************************************
 * Copyright (C) 2021, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************/

/******************************************************************************
 * @file   adt.c
 *
 * @brief  Source file for Advanced Timer functions
 *
 * @author MADS Team 
 *
 ******************************************************************************/

/******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32l19x_adt.h"

/**
 ******************************************************************************
 ** \addtogroup AdtGroup
 ******************************************************************************/
//@{

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define IS_VALID_ADT_STATE(x)         (  AdtCMAF == (x)||\
                                         AdtCMBF == (x)||\
                                         AdtCMCF == (x)||\
                                         AdtCMDF == (x)||\
                                         AdtOVFF == (x)||\
                                         AdtUDFF == (x)||\
                                         AdtDTEF == (x)||\
                                         AdtCMSAUF == (x)||\
                                         AdtCMSADF == (x)||\
                                         AdtCMSBUF == (x)||\
                                         AdtCMSBDF == (x)||\
                                         AdtCntDir == (x) )
#define ADTIM_HW_STASTPCLR_EN            31
#define ADTIM_HW_STASTPCLR_DIS           0x7FFFFFFF
#define ADTIM_SS_TIM4                    1
#define ADTIM_SS_TIM5                    2
#define ADTIM_SS_TIM6                    4
#define ADTIM_PORT_BKE_NUM               15
/******************************************************************************
 * Global variable definitions (declared in header file with 'extern')        *
 ******************************************************************************/

/******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*****************************************************************************
 * Function implementation - global ('extern') and local ('static')
 *****************************************************************************/



/*****************************************************************
 * \brief   
 *          配置中断
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtIrq         中断类型
 * \param   [in]  bEn              中断使能/禁止
 *
 * \retval  en_result_t  Ok:  配置成功
 *
 ****************************************************************/
en_result_t Adt_CfgIrq(M0P_ADTIM_TypeDef *ADTx,
                          en_adt_irq_type_t enAdtIrq,
                          boolean_t bEn)
{
    uint32_t u32Val;

    u32Val = ADTx->ICONR;
    if (bEn)
    {
        u32Val |= 1u<<enAdtIrq;
    }
    else
    {
        u32Val &= ~(1u<<enAdtIrq);
    }
    ADTx->ICONR = u32Val;
    return Ok;
}

/*******************************************************************
 * \brief   
 *          获取中断标志
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtIrq         中断类型
 * 
 *
 * \retval  TRUE/FALSE
 * 
 *****************************************************************/
boolean_t Adt_GetIrqFlag(M0P_ADTIM_TypeDef *ADTx,
                           en_adt_irq_type_t enAdtIrq)
{
    uint32_t u32Val;
    boolean_t bEn;

    ASSERT(IS_VALID_ADT_UNIT(enAdtUnit));

    u32Val = ADTx->IFR;
    bEn = (u32Val>>enAdtIrq) & 0x1;

    return bEn;
}

/****************************************************************
 * \brief   
 *          清除中断标志
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtIrq         中断类型
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 ****************************************************************/
en_result_t Adt_ClearIrqFlag(M0P_ADTIM_TypeDef *ADTx,
                             en_adt_irq_type_t enAdtIrq)
{
    ADTx->ICLR = ~(1u<<enAdtIrq);
    return Ok;
}

/****************************************************************
 * \brief   
 *          清除所有中断标�?
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 ****************************************************************/
en_result_t Adt_ClearAllIrqFlag(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->ICLR = 0;
    return Ok;
}

/**************************************************************
 * \brief   
 *          配置硬件递加事件
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtHwCntUp     硬件递加事件
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 ****************************************************************/
en_result_t Adt_CfgHwCntUp(M0P_ADTIM_TypeDef *ADTx, en_adt_hw_cnt_t enAdtHwCntUp)
{
    uint32_t u32Val;
     

    if (AdtHwCntMax <= enAdtHwCntUp)
    {
        return ErrorInvalidParameter;
    }

