ZeroZap/xhsc/HC32L19x/driver/src/hc32l19x_adt.c
    u32Val = ADTx->HCUPR;
    ADTx->HCUPR = u32Val | (1u<<enAdtHwCntUp);
    return Ok;
}

/**************************************************************
 * \brief   
 *          清除硬件递加事件
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 ************************************************************/
en_result_t Adt_ClearHwCntUp(M0P_ADTIM_TypeDef *ADTx)
{

    ADTx->HCUPR = 0;
    return Ok;
}


/**********************************************************
 * \brief   
 *          配置硬件递减事件
 *
 * \param   [in]  ADTx               ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtHwCntDwn      硬件递减事件
 *
 * \retval  en_result_t    Ok:  设置成功
 * \retval  en_result_t    ErrorInvalidParameter:  无效参数
 ***********************************************************/
en_result_t Adt_CfgHwCntDwn(M0P_ADTIM_TypeDef *ADTx, en_adt_hw_cnt_t enAdtHwCntDwn)
{
    uint32_t u32Val;
     

    if(AdtHwCntMax <= enAdtHwCntDwn)
    {
        return ErrorInvalidParameter;
    }

    u32Val = ADTx->HCDOR;
    ADTx->HCDOR = u32Val | (1u<<enAdtHwCntDwn);
    return Ok;
}

/******************************************************************
 * \brief   
 *          清除硬件递减事件
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 *****************************************************************/
en_result_t Adt_ClearHwCntDwn(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->HCDOR = 0;
    return Ok;
}

/******************************************************************
 * \brief   
 *          配置硬件启动事件
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtHwStart     硬件启动事件
 *
 * \retval  en_result_t    Ok:  设置成功
 * \retval  en_result_t    ErrorInvalidParameter:  无效参数
 *******************************************************************/
en_result_t Adt_CfgHwStart(M0P_ADTIM_TypeDef *ADTx, en_adt_hw_trig_t enAdtHwStart)
{
    uint32_t u32Val;
     

    if(AdtHwTrigEnd <= enAdtHwStart)
    {
        return ErrorInvalidParameter;
    }
    u32Val = ADTx->HSTAR;
    ADTx->HSTAR = u32Val | (1u<<enAdtHwStart);
    return Ok;
}

/************************************************************************
 * \brief   
 *          清除硬件启动事件
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 ***********************************************************************/
en_result_t Adt_ClearHwStart(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->HSTAR = 0;
    return Ok;
}

/*********************************************************************
 * \brief   
 *          使能硬件启动
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 *********************************************************************/
en_result_t Adt_EnableHwStart(M0P_ADTIM_TypeDef *ADTx)
{
    uint32_t u32Val;
    
    u32Val = ADTx->HSTAR;
    ADTx->HSTAR = u32Val | (1u<<ADTIM_HW_STASTPCLR_EN);
    return Ok;
}

/*************************************************************************
 * \brief   
 *          除能硬件启动
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 ************************************************************************/
en_result_t Adt_DisableHwStart(M0P_ADTIM_TypeDef *ADTx)
{
    uint32_t u32Val;

    u32Val = ADTx->HSTAR;
    ADTx->HSTAR = u32Val & ADTIM_HW_STASTPCLR_DIS;
    return Ok;
}

/****************************************************************
 * \brief   
 *          配置硬件停止事件
 *
 * \param   [in]  ADTx            ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtHwStop     硬件停止事件
 *
 * \retval  en_result_t    Ok:  设置成功
 * \retval  en_result_t    ErrorInvalidParameter:  无效参数
 ***************************************************************/
en_result_t Adt_CfgHwStop(M0P_ADTIM_TypeDef *ADTx, en_adt_hw_trig_t enAdtHwStop)
{
    uint32_t u32Val;
    
    if(AdtHwTrigEnd <= enAdtHwStop)
    {
        return ErrorInvalidParameter;
    }
    
    u32Val = ADTx->HSTPR;
    ADTx->HSTPR = u32Val | (1u<<enAdtHwStop);
    return Ok;
}

/***************************************************************
 * \brief
 *          清除硬件停止事件
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 ***************************************************************/
en_result_t Adt_ClearHwStop(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->HSTPR = 0;
    return Ok;
}

/*************************************************************
 * \brief   
 *          使能硬件停止
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 **********************************************************/
en_result_t Adt_EnableHwStop(M0P_ADTIM_TypeDef *ADTx)
{
    uint32_t u32Val;
    
    u32Val = ADTx->HSTPR;
    ADTx->HSTPR = u32Val | (1u<<ADTIM_HW_STASTPCLR_EN);
    return Ok;
}

/*****************************************************************************
 * \brief   
 *          除能硬件停止
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 ***************************************************************************/
en_result_t Adt_DisableHwStop(M0P_ADTIM_TypeDef *ADTx)
{
    uint32_t u32Val;

    u32Val = ADTx->HSTPR;
    ADTx->HSTPR = u32Val & ADTIM_HW_STASTPCLR_DIS;
    return Ok;
}

/**************************************************************************
 * \brief   
 *          配置硬件清零事件
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtHwClear      硬件清零事件
 *
 * \retval  en_result_t    Ok:  设置成功
 * \retval  en_result_t    ErrorInvalidParameter:  无效参数
 *************************************************************************/
en_result_t Adt_CfgHwClear(M0P_ADTIM_TypeDef *ADTx, en_adt_hw_trig_t enAdtHwClear)
{
    uint32_t u32Val;
     

    if(AdtHwTrigEnd <= enAdtHwClear)
    {
        return ErrorInvalidParameter;
    }
    
    u32Val = ADTx->HCELR;
    ADTx->HCELR = u32Val | (1u<<enAdtHwClear);
    return Ok;
}

/**************************************************************************
 * \brief   
 *          清除硬件清零事件
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 **************************************************************************/
en_result_t Adt_ClearHwClear(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->HCELR = 0;
    return Ok;
}

/***************************************************************************
 * \brief   
 *          使能硬件清零
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 *************************************************************************/
en_result_t Adt_EnableHwClear(M0P_ADTIM_TypeDef *ADTx)
{
    uint32_t u32Val;

    u32Val = ADTx->HCELR;
    ADTx->HCELR = u32Val | (1u<<ADTIM_HW_STASTPCLR_EN);
    return Ok;
}

/************************************************************************
 * \brief   
 *          除能硬件清零
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 **********************************************************************/
en_result_t Adt_DisableHwClear(M0P_ADTIM_TypeDef *ADTx)
{
    uint32_t u32Val;

    u32Val = ADTx->HCELR;
    ADTx->HCELR = u32Val & ADTIM_HW_STASTPCLR_DIS;
    return Ok;
}

/*******************************************************************
 * \brief   
 *          配置硬件捕获A事件
 *
 * \param   [in]  ADTx               ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtHwCaptureA    硬件捕获A事件选择
 *
 * \retval  en_result_t    Ok:  设置成功
 * \retval  en_result_t    ErrorInvalidParameter:  无效参数
 *******************************************************************/
en_result_t Adt_CfgHwCaptureA(M0P_ADTIM_TypeDef *ADTx, en_adt_hw_trig_t enAdtHwCaptureA)
{
    uint32_t u32Val;
     

    if(AdtHwTrigEnd <= enAdtHwCaptureA)
    {
        return ErrorInvalidParameter;
    }

    u32Val = ADTx->HCPAR;
    ADTx->HCPAR = u32Val | (1u<<enAdtHwCaptureA);
    ADTx->PCONR_f.CAPCA = 1;
    return Ok;
}

/************************************************************************
 * \brief   
 *          清除硬件捕获A事件
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t    Ok:  设置成功
 * 
 ***********************************************************************/
en_result_t Adt_ClearHwCaptureA(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->HCPAR = 0;
    return Ok;
}

/*********************************************************************
 * \brief   
 *          配置硬件捕获B事件
 *
 * \param   [in]  ADTx                ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtHwCaptureB     硬件捕获B事件选择
 *
 * \retval  en_result_t    Ok:  设置成功
 * \retval  en_result_t    ErrorInvalidParameter:  无效参数
 ********************************************************************/
en_result_t Adt_CfgHwCaptureB(M0P_ADTIM_TypeDef *ADTx, en_adt_hw_trig_t enAdtHwCaptureB)
{
    uint32_t u32Val;
     

    if(AdtHwTrigEnd <= enAdtHwCaptureB)
    {
        return ErrorInvalidParameter;
    }

