ZeroZap/xhsc/HC32L19x/driver/src/hc32l19x_adt.c
/********************************************************************
 * \brief   
 *          获取同高同低刹车标志
 *
 * \param   none
 *
 * \retval  TRUE or FALSE
 ********************************************************************/
boolean_t Adt_GetSameBrakeFlag(void)
{
    return M0P_ADTIM4->AOSSR_f.FSAME;
}

/*********************************************************************
 * \brief   
 *          清除同高同低刹车标志
 *
 * \param   none
 *
 * \retval  none
 *********************************************************************/
void Adt_ClearSameBrakeFlag(void)
{
    M0P_ADTIM4->AOSCL_f.FSAME = 0;
}

/********************************************************************
 * \brief   
 *          PWM展频配置
 * \param   [in]  ADTx                  ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  pstcAdtPwmDitherCfg   PWM展频配置指针
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 *********************************************************************/
en_result_t Adt_PwmDitherCfg(M0P_ADTIM_TypeDef *ADTx, stc_adt_pwm_dither_cfg_t* pstcAdtPwmDitherCfg)
{
     
    
    if (NULL == pstcAdtPwmDitherCfg)
    {
        return ErrorInvalidParameter;
    }

    ADTx->CR_f.DITENS = pstcAdtPwmDitherCfg->enAdtPDType;
    ADTx->CR_f.DITENB = pstcAdtPwmDitherCfg->bTimxBPDEn;
    ADTx->CR_f.DITENA = pstcAdtPwmDitherCfg->bTimxAPDEn;
    
    return Ok;
}

/**********************************************************************
 * \brief   
 *          ADT初始�?
 *
 * \param   [in]  ADTx                  ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  pstcAdtBaseCntCfg     计数配置指针
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 **********************************************************************/
en_result_t Adt_Init(M0P_ADTIM_TypeDef *ADTx, stc_adt_basecnt_cfg_t* pstcAdtBaseCntCfg)
{
     

    if(NULL == pstcAdtBaseCntCfg)
    {
        return ErrorInvalidParameter;
    }

    if (AdtTriangleModeB < pstcAdtBaseCntCfg->enCntMode)
    {
        return ErrorInvalidParameter;
    }

    ADTx->GCONR_f.MODE = pstcAdtBaseCntCfg->enCntMode;
    ADTx->GCONR_f.DIR = pstcAdtBaseCntCfg->enCntDir;
    ADTx->GCONR_f.CKDIV = pstcAdtBaseCntCfg->enCntClkDiv;

    return Ok;
}

/************************************************************************
 * \brief   
 *          ADT Deinit
 *
 * \param   [in]  ADTx                  ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 ***********************************************************************/
en_result_t Adt_DeInit(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->GCONR_f.START = 0;
    ADTx->CNTER = 0;
    ADTx->PCONR = 0;
    ADTx->GCONR = 0x00000100;
    ADTx->DCONR = 0;
    ADTx->ICONR = 0;
    ADTx->BCONR = 0;
    ADTx->FCONR = 0;
    ADTx->VPERR = 0;
    ADTx->PERAR = 0xFFFF;
    ADTx->PERBR = 0xFFFF;
    ADTx->GCMAR = 0xFFFF;
    ADTx->GCMBR = 0xFFFF;
    ADTx->GCMCR = 0xFFFF;
    ADTx->GCMDR = 0xFFFF;
    ADTx->DTDAR = 0xFFFF;
    ADTx->DTUAR = 0xFFFF;
    ADTx->HSTAR = 0;
    ADTx->HSTPR = 0;
    ADTx->HCELR = 0;
    ADTx->HCPAR = 0;
    ADTx->HCPBR = 0;
    ADTx->HCUPR = 0;
    ADTx->HCDOR = 0;
    ADTx->SSTAR = 0;
    ADTx->SSTPR = 0;
    ADTx->SCLRR = 0;
    ADTx->IFR = 0;
    ADTx->CR = 0x00000300;
    ADTx->AOSSR = 0;
    ADTx->AOSCL = 0;
    ADTx->PTBKS = 0;
    ADTx->PTBKP = 0;
    ADTx->TTRIG = 0;
    ADTx->ITRIG = 0;

    return Ok;
}

/***********************************************************************
 * \brief   
 *          开始计�?
 *
 * \param   [in]  ADTx                  ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 ***********************************************************************/
en_result_t Adt_StartCount(M0P_ADTIM_TypeDef *ADTx)
{

    ADTx->GCONR_f.START = 1;

    return Ok;
}

/***********************************************************************
 * \brief   
 *          停止计数
 *
 * \param   [in]  ADTx        ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 **********************************************************************/
en_result_t Adt_StopCount(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->GCONR_f.START = 0;

    return Ok;
}

/********************************************************************
 * \brief   
 *          设置计数�?
 *
 * \param   [in]  ADTx           ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  u16Value       计数�?
 *
 * \retval  en_result_t  Ok:  配置成功
 *
 *******************************************************************/
en_result_t Adt_SetCount(M0P_ADTIM_TypeDef *ADTx, uint16_t u16Value)
{
    ADTx->CNTER_f.CNT = u16Value;
    return Ok;
}

/********************************************************************
 * \brief   
 *          获取计数�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * 
 *
 * \retval  uint16_t  u16Value:  当前计数�?
 *  
 *******************************************************************/
uint16_t Adt_GetCount(M0P_ADTIM_TypeDef *ADTx)
{
    uint16_t u16Value;

    ASSERT(IS_VALID_ADT_UNIT(enAdtUnit));

    u16Value = ADTx->CNTER_f.CNT;
    
    return u16Value;
}

/**************************************************************************
 * \brief   
 *          清除计数�?
 *
 * \param   [in]  ADTx        ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * 
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 **************************************************************************/
en_result_t Adt_ClearCount(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->CNTER_f.CNT = 0;
    return Ok;
}

/*************************************************************************
 * \brief   
 *          获取有效周期计数�?
 *
 * \param   [in]  ADTx             ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  uint8_t u8TempCnt:    有效周期�?
 * 
 *************************************************************************/
uint8_t Adt_GetVperNum(M0P_ADTIM_TypeDef *ADTx)
{
    uint8_t u8TempCnt;
     

    ASSERT(IS_VALID_ADT_UNIT(enAdtUnit));
    
    u8TempCnt = ADTx->STFLR_f.VPERNUM;

    return u8TempCnt;
}

/*************************************************************************
 * \brief   
 *          获取状态标�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
* \param    [in]  enstate           状态标志类�?
 *
 * \retval  TURE/FALSE
 * 
 *************************************************************************/
boolean_t Adt_GetState(M0P_ADTIM_TypeDef *ADTx, en_adt_state_type_t enstate)
{
     

    ASSERT(IS_VALID_ADT_UNIT(enAdtUnit));
    ASSERT(IS_VALID_ADT_STATE(enstate));

    return GetBit(((uint32_t)&ADTx->STFLR), enstate);
}

/***********************************************************************
 * \brief   
 *          配置计数周期
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  u16Period         计数周期�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 ***********************************************************************/
en_result_t Adt_SetPeriod(M0P_ADTIM_TypeDef *ADTx, uint16_t u16Period)
{
    ADTx->PERAR = u16Period;

    return Ok;
}

/***********************************************************************
 * \brief   
 *          配置计数周期缓冲
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  u16PeriodBuf      计数周期缓冲�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 ***********************************************************************/
en_result_t Adt_SetPeriodBuf(M0P_ADTIM_TypeDef *ADTx, uint16_t u16PeriodBuf)
{
    ADTx->PERBR = u16PeriodBuf;
    ADTx->BCONR_f.BENP = 1u;

    return Ok;
}

/**********************************************************************
 * \brief   
 *          清除计数周期缓冲
 *
 * \param   [in]  ADTx        ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 **********************************************************************/
en_result_t Adt_ClearPeriodBuf(M0P_ADTIM_TypeDef *ADTx)
{
    ADTx->BCONR_f.BENP = 0;
    ADTx->PERBR = 0;

    return Ok;
}

/***********************************************************************
 * \brief   
 *          配置有效计数周期
 *
 * \param   [in]  ADTx                     ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  pstcAdtValidPerCfg       有效计数周期配置指针
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 ***********************************************************************/
en_result_t Adt_SetValidPeriod(M0P_ADTIM_TypeDef *ADTx,
                               stc_adt_validper_cfg_t* pstcAdtValidPerCfg)
{
     

    if(NULL == pstcAdtValidPerCfg)
    {
        return ErrorInvalidParameter;
    }

    ADTx->VPERR_f.PCNTS = pstcAdtValidPerCfg->enValidCnt;
    ADTx->VPERR_f.PCNTE = pstcAdtValidPerCfg->enValidCdt;
    ADTx->VPERR_f.GEPERID = pstcAdtValidPerCfg->bPeriodD;
    ADTx->VPERR_f.GEPERIC = pstcAdtValidPerCfg->bPeriodC;
    ADTx->VPERR_f.GEPERIB = pstcAdtValidPerCfg->bPeriodB;
    ADTx->VPERR_f.GEPERIA = pstcAdtValidPerCfg->bPeriodA;

    return Ok;
}

/************************************************************************
 * \brief   
 *          配置比较输出计数基准�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtCompare      通用比较基准寄存�?
 * \param   [in]  u16Compare        比较基准�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 *************************************************************************/
en_result_t Adt_SetCompareValue(M0P_ADTIM_TypeDef *ADTx,
                                en_adt_compare_t enAdtCompare,
                                uint16_t u16Compare)
{
    if (AdtCompareA == enAdtCompare)
    {
        ADTx->GCMAR = u16Compare;
    }
    else if (AdtCompareB == enAdtCompare)
    {
        ADTx->GCMBR = u16Compare;
    }
    else if (AdtCompareC == enAdtCompare)
    {
        ADTx->GCMCR = u16Compare;
    }
    else if (AdtCompareD == enAdtCompare)
    {
        ADTx->GCMDR = u16Compare;
    }
    else
    {
        return ErrorInvalidParameter;
    }

    return Ok;
}

/************************************************************************
 * \brief   
 *          配置专用比较计数基准�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtSpclCmp      专用比较基准值寄存器
 * \param   [in]  u16SpclCmp        比较基准�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 *************************************************************************/
en_result_t Adt_SetSpecilCompareValue(M0P_ADTIM_TypeDef *ADTx,
                                      en_adt_special_compare_t enAdtSpclCmp,
                                      uint16_t u16SpclCmp)
{
    if (AdtSpclCompA == enAdtSpclCmp)
    {
        ADTx->SCMAR_f.SCMA = u16SpclCmp;
    }
    else if (AdtSpclCompB == enAdtSpclCmp)
    {
        ADTx->SCMBR_f.SCMB = u16SpclCmp;
    }
    else
    {
        return ErrorInvalidParameter;
    }

    return Ok;
}

/**********************************************************************
 * \brief   
 *          配置通用比较�?捕获值缓存传�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtCHxXPort     TIMxX通道
 * \param   [in]  bCompareBufEn     通用比较值缓存传送使�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 **********************************************************************/
en_result_t Adt_EnableValueBuf(M0P_ADTIM_TypeDef *ADTx,
                                 en_adt_CHxX_port_t enAdtCHxXPort,
                                 boolean_t bCompareBufEn)
{
    if (AdtCHxA == enAdtCHxXPort)
    {
        ADTx->BCONR_f.BENA = bCompareBufEn;
    }
    else if (AdtCHxB == enAdtCHxXPort)
    {
        ADTx->BCONR_f.BENB = bCompareBufEn;
    }
    else
    {
        return ErrorInvalidParameter;
    }

    return Ok;
}

/***********************************************************************
 * \brief   
 *          清除比较输出计数�?捕获值缓�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtCHxXPort     TIMxX通道
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 **********************************************************************/
en_result_t Adt_ClearValueBuf(M0P_ADTIM_TypeDef *ADTx,
                                     en_adt_CHxX_port_t enAdtCHxXPort)
{
    if (AdtCHxA == enAdtCHxXPort)
    {
        ADTx->GCMCR = 0;
    }
    else if (AdtCHxB == enAdtCHxXPort)
    {
        ADTx->GCMDR = 0;
    }
    else
    {
        return ErrorInvalidParameter;
    }

    return Ok;
}

/***********************************************************************
 * \brief   
 *          获取捕获�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtCHxXPort     TIMxX通道
 * \param   [in]  pu16Capture       捕获值指�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 ***********************************************************************/
en_result_t Adt_GetCaptureValue(M0P_ADTIM_TypeDef *ADTx,
                                en_adt_CHxX_port_t enAdtCHxXPort,
                                uint16_t* pu16Capture)
{
    if (AdtCHxA == enAdtCHxXPort)
    {
        *pu16Capture = ADTx->GCMAR_f.GCMA;
    }
    else if (AdtCHxB == enAdtCHxXPort)
    {
        *pu16Capture = ADTx->GCMBR_f.GCMB;
    }
    else
    {
        return ErrorInvalidParameter;
    }
    return Ok;
}

/**********************************************************************
 * \brief   
 *          获取捕获缓存�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  enAdtCHxXPort     TIMxX通道
 * \param   [in]  pu16CaptureBuf    捕获缓存值指�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * \retval  en_result_t  ErrorInvalidParameter: 无效参数
 ***********************************************************************/
en_result_t Adt_GetCaptureBuf(M0P_ADTIM_TypeDef *ADTx,
                                en_adt_CHxX_port_t enAdtCHxXPort,
                                uint16_t* pu16CaptureBuf)
{
    if (AdtCHxA == enAdtCHxXPort)
    {
        *pu16CaptureBuf = ADTx->GCMCR_f.GCMC;
    }
    else if (AdtCHxB == enAdtCHxXPort)
    {
        *pu16CaptureBuf = ADTx->GCMDR_f.GCMD;
    }
    else
    {
        return ErrorInvalidParameter;
    }
    return Ok;
}

/***********************************************************************
 * \brief   
 *          设置死区时间上基准�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  u16Value          死区时间上基准�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 ************************************************************************/
en_result_t Adt_SetDTUA(M0P_ADTIM_TypeDef *ADTx,
                        uint16_t u16Value)
{
    ADTx->DTUAR = u16Value;

    return Ok;
}

/***********************************************************************
 * \brief   
 *          设置死区时间下基准�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  u16Value          死区时间下基准�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 ***********************************************************************/
en_result_t Adt_SetDTDA(M0P_ADTIM_TypeDef *ADTx,
                        uint16_t u16Value)
{
    ADTx->DTDAR = u16Value;

    return Ok;
}

/******************************************************************
 * \brief   
 *          配置死区时间功能
 *
 * \param   [in]  ADTx          ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  bDTEn         死区功能使能
 * \param   [in]  bEqual        DTDAR的值和DTUAR的值自动相�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 *****************************************************************/
en_result_t Adt_CfgDT(M0P_ADTIM_TypeDef *ADTx,
                         boolean_t bDTEn,
                         boolean_t bEqual)
{
    ADTx->DCONR_f.DTCEN = bDTEn;
    ADTx->DCONR_f.SEPA = bEqual;

    return Ok;
}

/*************************************************************************
 * \brief   
 *          Z相输入屏蔽设�?
 *
 * \param   [in]  ADTx              ADV Timer通道选择(M0P_ADTIM4、M0P_ADTIM5、M0P_ADTIM6)
 * \param   [in]  pstcAdtZMaskCfg   Z相输入屏蔽功能配置指�?
 *
 * \retval  en_result_t  Ok:  配置成功
 * 
 *************************************************************************/
en_result_t Adt_CfgZMask(M0P_ADTIM_TypeDef *ADTx, stc_adt_zmask_cfg_t* pstcAdtZMaskCfg)
{
    if(NULL == pstcAdtZMaskCfg)
    {
        return ErrorInvalidParameter;
    }

    ADTx->GCONR_f.ZMSK = pstcAdtZMaskCfg->enZMaskCycle;
    ADTx->GCONR_f.ZMSKPOS = pstcAdtZMaskCfg->bFltPosCntMaksEn;
    ADTx->GCONR_f.ZMSKREV = pstcAdtZMaskCfg->bFltRevCntMaksEn;

    return Ok;
}

//@} // AdtGroup

/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/

